// Напишите программу, которая на вход принимает число и выводит его квадрат.
// 
// int result=nConsole.WriteLine("Введите целое число");
// int num = Convert.ToInt32(Console.ReadLine());
// result = num*num;
// System.Console.WriteLine("Квадрат введенного числа равен "+result);

// if (num>0)
// {
//      System.Console.WriteLine("Вы ввели положительное число");
// }
// else if (num==0)
//      System.Console.WriteLine("Вы ввели ноль");
// else
//      System.Console.WriteLine("Вы ввели отрицательное число");

// // Напишите программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго.
// Console.WriteLine("Введите число А: ");
// Console.WriteLine("Введите число В: ");
// int numA = Convert.ToInt32(Console.ReadLine());
// int numB = Convert.ToInt32(Console.ReadLine());
// if (numA==numB*numB)
// {
//     System.Console.WriteLine("Является!");
// }
// else  
//     System.Console.WriteLine("Не является!");

// Напишите программу, которая будет выдавать название дня недели по заданному номеру.
// Console.WriteLine("Введите число от 1 до 7");
// int num = Convert.ToInt32(Console.ReadLine());
// if (num == 1)
// {
//     System.Console.WriteLine("Понедельник");
// }
// else if (num == 2)
//     System.Console.WriteLine("Вторник");
// else if (num == 3)
//     System.Console.WriteLine("Среда");
// else if (num == 4)
//     System.Console.WriteLine("Четверг");
// else if (num == 5)
//     System.Console.WriteLine("Пятница");
// else if (num == 6)
//     System.Console.WriteLine("Суббота");
// else if (num == 7)
//     System.Console.WriteLine("Воскресенье");
// else 
//     System.Console.WriteLine("Вы ввели не верное число");

// Console.WriteLine("Введите число от 1 до 7");
// int num = Convert.ToInt32(Console.ReadLine());
// switch (num)
// {
//     case 1:
//        System.Console.WriteLine("Понедельник");
//        break;
//     case 2:
//        System.Console.WriteLine("Вторник");
//        break;
//     case 3:
//        System.Console.WriteLine("Среда");
//        break;
//     case 4:
//        System.Console.WriteLine("Четверг");
//        break;
//     case 5:
//        System.Console.WriteLine("Пятница");
//        break;
//     case 6:
//        System.Console.WriteLine("Суббота");
//        break;
//     case 7:
//        System.Console.WriteLine("Воскресенье");
//        break;
//     default:
//        System.Console.WriteLine("Вы ввели неверное число");
//        break;
// }

